cf/ChartsOfCharacteristicTypes/нсиНаименованияХарактеристикУниверсальногоСправочника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>нсиНаименованияХарактеристикУниверсальногоСправочника</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.нсиУниверсальныйФункциональныйСправочник</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.нсиУниверсальныйКлассификатор</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>16</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>150</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СклоненияПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКлассификатора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиВидыСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСправочника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиВидыСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

cf/ChartsOfCharacteristicTypes/нсиНаименованияХарактеристикУниверсальногоСправочника/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ) 
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	// проверка существования наименования с таким же именем и типом
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидКлассификатора", ВидКлассификатора);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаименованияХарактеристик.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.нсиНаименованияХарактеристикУниверсальногоСправочника КАК НаименованияХарактеристик
		|ГДЕ
		|	НаименованияХарактеристик.Наименование = &Наименование
		|	И НаименованияХарактеристик.ВидКлассификатора = &ВидКлассификатора
		|	И НЕ НаименованияХарактеристик.Ссылка = &Ссылка";        		
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();  
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Ссылка.ТипЗначения = ТипЗначения Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Такое наименование, с таким типом уже определено");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипЗначения.СодержитТип(Тип("СправочникСсылка.нсиУниверсальныйФункциональныйСправочник")) Тогда
		ПроверяемыеРеквизиты.Добавить("ВидСправочника");		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
